### Import required dependencies

In [3]:
import pandas as pd
import numpy as np
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [4]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [5]:
# Verify that the data was properly imported
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19510,63239258,David Herman,9th,Woods High School,52.1,80.4,Public,912243
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [6]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [59]:
# Drop rows with null values and verify removal
student_df.dropna(inplace=True)
student_df.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [60]:
# Check for duplicated rows
student_df.duplicated().sum(0)

0

In [61]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum(0)

0

In [62]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [63]:
# Examine the grade column to understand why it is not an int
student_df.loc[:, "grade"]

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [12]:
# Remove the non-numeric characters and verify the contents of the column
student_df.loc[:, "grade"] = student_df.loc[:, "grade"].str.replace("th", "")
student_df
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [13]:
# Change the grade column to the int type and verify column types
student_df.loc[:, "grade"] = student_df.loc[:, "grade"].astype("int")
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [14]:
# Display summary statistics for the DataFrame
student_df.describe(include='all')

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
count,1.734600e+04,17346,17346.000000,17346,15611.000000,16479.000000,17346,17346.000000
unique,NaN,15551,NaN,15,NaN,NaN,2,NaN
top,NaN,Jennifer Smith,NaN,Montgomery High School,NaN,NaN,Public,NaN
freq,NaN,8,NaN,2394,NaN,NaN,9497,NaN
mean,6.971921e+07,NaN,10.356393,NaN,72.371046,64.715899,NaN,893753.090741
std,3.458822e+07,NaN,1.097201,NaN,15.206900,15.827649,NaN,53950.325200
min,1.000906e+07,NaN,9.000000,NaN,10.500000,3.700000,NaN,817615.000000
25%,3.962676e+07,NaN,9.000000,NaN,62.200000,54.500000,NaN,846745.000000
50%,6.961437e+07,NaN,10.000000,NaN,73.800000,65.300000,NaN,893368.000000
75%,9.944595e+07,NaN,11.000000,NaN,84.000000,76.000000,NaN,956438.000000
max,1.299997e+08,NaN,12.000000,NaN,100.000000,100.000000,NaN,991918.000000

In [15]:
# Display the mean math score using the mean function
mean_math_score = student_df["math_score"].mean()
mean_math_score

64.71589902299891

In [16]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df["reading_score"].min()
min_reading_score

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [17]:
# Use loc to display the grade column
student_df.loc[:, "grade"]

0         9
1         9
2         9
3         9
4        11
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 17346, dtype: int32

In [18]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3,3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [19]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
ninth_grade_stats = student_df.loc[student_df["grade"] == 9]
ninth_grade_stats.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.832000e+03  4832.0    4353.000000  4587.000000    4832.000000
mean   6.973426e+07     9.0      69.322927    66.686222  898548.483858
std    3.468975e+07     0.0      15.287125    16.692797   54770.293534
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.957139e+07     9.0      59.100000    56.100000  846745.000000
50%    6.984037e+07     9.0      70.100000    67.800000  893368.000000
75%    9.942976e+07     9.0      80.600000    78.600000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [20]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [21]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
dixon_reading_scores_df = student_df.loc[student_df["school_name"] == "Dixon High School", "reading_score"]
dixon_reading_scores_tenth_grade = dixon_reading_scores_df.loc[student_df["grade"] == 10]
dixon_reading_scores_tenth_grade

45       71.1
60       59.5
69       88.6
94       81.5
100      95.3
         ...
19283    52.9
19306    58.0
19344    38.0
19368    84.4
19445    43.9
Name: reading_score, Length: 654, dtype: float64

In [22]:
# Find the mean reading score for all students in grades 11 and 12 combined.
options = [11, 12]
twelvth_and_eleventh_grade_reading_score = student_df.loc[student_df["grade"].isin(options), "reading_score"]

twelvth_and_eleventh_grade_reading_score.mean()

74.89692075471689

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [23]:
# Use groupby and mean to find the average reading and math scores for each school type.
school_type_mean_scores_df = student_df.groupby(by= "school_type").mean()
school_type_mean_scores_df.loc[:, ["reading_score", "math_score"]]

             reading_score  math_score
school_type
Charter          72.429518   66.849599
Public           72.322895   62.945831

In [67]:
# Display the average budget for each scool type using the groupby and mean fuctions.
school_type_budget_df = student_df.groupby(by= "school_type").mean()
school_type_budget_df.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [64]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
student_count_series = student_df.groupby(by= "school_name").count()
student_count_series = student_count_series[["student_id"]].rename(columns={"student_id": "student_count"})
.sort_values(by= "student_count", ascending =False)

In [65]:
student_count_series

                        student_count
school_name
Montgomery High School           2038
Green High School                1961
Dixon High School                1583
Wagner High School               1541
Silva High School                1109
Woods High School                1052
Sullivan High School              971
Turner High School                846
Bowers High School                803
Fisher High School                798
Richard High School               551
Campos High School                541
Odonnell High School              459
Campbell High School              407
Chang High School                 171

In [66]:
# find the average math score for each grade by school type
school_type_df = student_df[["grade", "school_type", "math_score"]].groupby(by=["school_type", "grade"],as_index=True).mean()
school_type_df.loc[:, "math_score"].round()

school_type  grade
Charter      9        70.0
             10       66.0
             11       68.0
             12       60.0
Public       9        64.0
             10       64.0
             11       59.0
             12       64.0
Name: math_score, dtype: float64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

# See README.md